{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.3.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 300], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_input"}}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": false, "batch_input_shape": [null, 300], "dtype": "float32", "input_dim": 290419, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 300}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 100, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "implementation": 1}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "binary_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of84.bin", "group1-shard2of84.bin", "group1-shard3of84.bin", "group1-shard4of84.bin", "group1-shard5of84.bin", "group1-shard6of84.bin", "group1-shard7of84.bin", "group1-shard8of84.bin", "group1-shard9of84.bin", "group1-shard10of84.bin", "group1-shard11of84.bin", "group1-shard12of84.bin", "group1-shard13of84.bin", "group1-shard14of84.bin", "group1-shard15of84.bin", "group1-shard16of84.bin", "group1-shard17of84.bin", "group1-shard18of84.bin", "group1-shard19of84.bin", "group1-shard20of84.bin", "group1-shard21of84.bin", "group1-shard22of84.bin", "group1-shard23of84.bin", "group1-shard24of84.bin", "group1-shard25of84.bin", "group1-shard26of84.bin", "group1-shard27of84.bin", "group1-shard28of84.bin", "group1-shard29of84.bin", "group1-shard30of84.bin", "group1-shard31of84.bin", "group1-shard32of84.bin", "group1-shard33of84.bin", "group1-shard34of84.bin", "group1-shard35of84.bin", "group1-shard36of84.bin", "group1-shard37of84.bin", "group1-shard38of84.bin", "group1-shard39of84.bin", "group1-shard40of84.bin", "group1-shard41of84.bin", "group1-shard42of84.bin", "group1-shard43of84.bin", "group1-shard44of84.bin", "group1-shard45of84.bin", "group1-shard46of84.bin", "group1-shard47of84.bin", "group1-shard48of84.bin", "group1-shard49of84.bin", "group1-shard50of84.bin", "group1-shard51of84.bin", "group1-shard52of84.bin", "group1-shard53of84.bin", "group1-shard54of84.bin", "group1-shard55of84.bin", "group1-shard56of84.bin", "group1-shard57of84.bin", "group1-shard58of84.bin", "group1-shard59of84.bin", "group1-shard60of84.bin", "group1-shard61of84.bin", "group1-shard62of84.bin", "group1-shard63of84.bin", "group1-shard64of84.bin", "group1-shard65of84.bin", "group1-shard66of84.bin", "group1-shard67of84.bin", "group1-shard68of84.bin", "group1-shard69of84.bin", "group1-shard70of84.bin", "group1-shard71of84.bin", "group1-shard72of84.bin", "group1-shard73of84.bin", "group1-shard74of84.bin", "group1-shard75of84.bin", "group1-shard76of84.bin", "group1-shard77of84.bin", "group1-shard78of84.bin", "group1-shard79of84.bin", "group1-shard80of84.bin", "group1-shard81of84.bin", "group1-shard82of84.bin", "group1-shard83of84.bin", "group1-shard84of84.bin"], "weights": [{"name": "dense/kernel", "shape": [100, 1], "dtype": "float32"}, {"name": "dense/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding/embeddings", "shape": [290419, 300], "dtype": "float32"}, {"name": "lstm/lstm_cell/kernel", "shape": [300, 400], "dtype": "float32"}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm/lstm_cell/bias", "shape": [400], "dtype": "float32"}]}]}